БПКР/src/Enums/ВидыОперацийПринятияКУчетуОсновныхСредств/ВидыОперацийПринятияКУчетуОсновныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийПринятияКУчетуОсновныхСредств</name>
  <enumValues>
    <name>Оборудование</name>
  </enumValues>
  <enumValues>
    <name>ОбъектыСтроительства</name>
  </enumValues>
  <enumValues>
    <name>ОсновныеСредства</name>
  </enumValues>
  <enumValues>
    <name>ПоРезультатамИнвентаризации</name>
  </enumValues>
</mdclass:Enum>

БПКР/src/Enums/ВидыСостоянийОС/ВидыСостоянийОС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыСостоянийОС</name>
  <enumValues>
    <name>Поступило</name>
  </enumValues>
  <enumValues>
    <name>ПринятоКУчету</name>
  </enumValues>
  <enumValues>
    <name>СнятоСУчета</name>
  </enumValues>
  <enumValues>
    <name>Передано</name>
  </enumValues>
</mdclass:Enum>

БПКР/src/Enums/ВидыОперацийСписанияОС/ВидыОперацийСписанияОС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийСписанияОС</name>
  <enumValues>
    <name>ПринятыеКУчетуОС</name>
  </enumValues>
  <enumValues>
    <name>НеПринятыеКУчетуОС</name>
  </enumValues>
</mdclass:Enum>

БПКР/src/Documents/ПринятиеКУчетуОС/ПринятиеКУчетуОС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПринятиеКУчетуОС</name>
  <basedOn>Document.ПоступлениеТоваровУслуг</basedOn>
  <basedOn>Document.ИнвентаризацияОС</basedOn>
  <registerRecords>InformationRegister.МестонахождениеОС</registerRecords>
  <registerRecords>InformationRegister.СведенияОбИмуществе</registerRecords>
  <registerRecords>AccumulationRegister.ДвижениеОСНУ</registerRecords>
  <registerRecords>InformationRegister.СведенияОТранспорте</registerRecords>
  <registerRecords>InformationRegister.ПараметрыУчетаОСЗемельныйНалог</registerRecords>
  <registerRecords>InformationRegister.ПараметрыУчетаОС</registerRecords>
  <registerRecords>InformationRegister.СостоянияОС</registerRecords>
  <registerRecords>InformationRegister.СобытияОС</registerRecords>
  <registerRecords>InformationRegister.ПараметрыУчетаОСЗемельныйНалогПодОбъектомИмущества</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийПринятияКУчетуОсновныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектСтроительства</name>
    <type>
      <types>CatalogRef.ОбъектыСтроительства</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчета</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснованиеВид</name>
    <comment>Документ-основание для принятия к учету ОС</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснованиеДата</name>
    <comment>Дата документа-основания для принятия к учету ОС</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснованиеНомер</name>
    <comment>Номер документа-основания для принятия к учету ОС</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОС</name>
    <attributes>
      <name>ОсновноеСредство</name>
      <type>
        <types>CatalogRef.ОсновныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>ИнвентарныйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПервоначальнаяСтоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЛиквидационнаяСтоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НакопленнаяАмортизация</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СчетУчета</name>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокСлужбы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СпособНачисленияАмортизации</name>
      <type>
        <types>EnumRef.СпособыНачисленияАмортизацииОС</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособОтраженияРасходовПоАмортизации</name>
      <type>
        <types>CatalogRef.СпособыОтраженияРасходовПоАмортизации</types>
      </type>
    </attributes>
    <attributes>
      <name>ПараметрВыработки</name>
      <type>
        <types>CatalogRef.ПараметрыВыработкиОС</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъемПродукции</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МОЛ</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.ПодразделенияОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>ГруппаНУ</name>
      <type>
        <types>CatalogRef.ГруппыНалоговогоУчетаОС</types>
      </type>
    </attributes>
    <attributes>
      <name>ГруппаИмущества</name>
      <type>
        <types>CatalogRef.ГруппыИмущества</types>
      </type>
    </attributes>
    <attributes>
      <name>КодИмущества</name>
      <type>
        <types>CatalogRef.КодыИмущества</types>
      </type>
    </attributes>
    <attributes>
      <name>МатериалСтен</name>
      <type>
        <types>CatalogRef.ВидыМатериаловСтенНалогНаИмущество</types>
      </type>
    </attributes>
    <attributes>
      <name>ЖилаяПлощадь</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НежилаяПлощадь</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РегиональныйКоэффициент</name>
      <type>
        <types>CatalogRef.РегиональныеКоэффициентыНалогНаИмущество</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗональныйКоэффициент</name>
      <type>
        <types>CatalogRef.ЗональныеКоэффициенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтраслевойКоэффициент</name>
      <type>
        <types>CatalogRef.ОтраслевыеКоэффициентыНалогНаИмущество</types>
      </type>
    </attributes>
    <attributes>
      <name>КатегорияИмущества</name>
      <type>
        <types>CatalogRef.КатегорияОбъектаИмущества</types>
      </type>
    </attributes>
    <attributes>
      <name>КодПользователяИмущества</name>
      <type>
        <types>CatalogRef.КодыПользователейИмущества</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидТранспорта</name>
      <type>
        <types>CatalogRef.ВидыТранспортаНалогНаИмущество</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВводаВЭксплуатацию</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъемДвигателя</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГосНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МаркаТранспортногоСредства</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоэффициентУскорения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачисленияНалогаНаИмущество</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КатегорияЗемель</name>
      <type>
        <types>EnumRef.КатегорииЗемель</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЗемельногоУчастка</name>
      <type>
        <types>EnumRef.ВидыЗемельныхУчастков</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЧеловек</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоэффициентКоммерческогоИспользования</name>
      <type>
        <types>CatalogRef.КоэффициентыКоммерческогоИспользования</types>
      </type>
    </attributes>
    <attributes>
      <name>Площадь</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Область</name>
      <type>
        <types>CatalogRef.Области</types>
      </type>
    </attributes>
    <attributes>
      <name>Район</name>
      <type>
        <types>CatalogRef.Районы</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачисленияЗамельногоНалога</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаЗНВторойКатегории</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УчастокПодОбъектомИмущества</name>
      <type>
        <types>CatalogRef.ОсновныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>ПлощадьПодОбъектомИмущества</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Комиссия</name>
    <attributes>
      <name>ФизЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Председатель</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

БПКР/src/Documents/ВыработкаОС/ВыработкаОС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВыработкаОС</name>
  <registerRecords>AccumulationRegister.ВыработкаОС</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОС</name>
    <attributes>
      <name>ОсновноеСредство</name>
      <type>
        <types>CatalogRef.ОсновныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>ИнвентарныйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПараметрВыработки</name>
      <type>
        <types>CatalogRef.ПараметрыВыработкиОС</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

БПКР/src/Documents/КомплектацияОС/КомплектацияОС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КомплектацияОС</name>
  <registerRecords>InformationRegister.СоставОС</registerRecords>
  <registerRecords>InformationRegister.ПараметрыУчетаКомплектовОС</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийКомплектацияОС</types>
    </type>
  </attributes>
  <attributes>
    <name>Комплект</name>
    <type>
      <types>CatalogRef.ОсновныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчета</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>МОЛ</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОС</name>
    <attributes>
      <name>ОсновноеСредство</name>
      <type>
        <types>CatalogRef.ОсновныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>Изменение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

БПКР/src/CommonModules/УправлениеВнеоборотнымиАктивамиКлиент/Module.bsl
#Область ПрограммныйИнтерфейс

// Открывает форму выбора справочника ОсновныеСредства с отбором ОС
// на указанную дату и в указанных, организации и подразделении
//
// Параметры:
//		ВладелецФормыВыбора					- Форма или элемент формы, для которого открывается форма выбора
//		Организация							- СправочникСсылка.Организации - , если не указана, в отбор попадают все сотрудники компании
//		Подразделение						- СправочникСсылка.ПодразделенияОрганизации - , если не указано - в отбор попадают все сотрудники
//		ДатаПримененияОтбора				- Дата - , на которую необходимо выбрать ОС
//      МножественныйВыбор					- Булево - , если ложь - форма откроется для выбора одного сотрудника
//		АдресСпискаПодобранныхСотрудников	- Строка - , адрес массива уже подобранных сотрудников во временном хранилище
//		СтруктураОтбора						- Структура - , аналогичная структуре отбора в параметрах формы списка
//
Процедура ВыбратьОСНаДату(ВладелецФормыВыбора, Организация = Неопределено, Подразделение = Неопределено, 
		МОЛ = Неопределено, Склад = Неопределено, Непринятые = Неопределено, ДатаПримененияОтбора = '00010101', 
		МножественныйВыбор = Истина, АдресСпискаПодобранныхОС = "", СтруктураОтбора = Неопределено) Экспорт
	
	Если СтруктураОтбора = Неопределено Тогда
		СтруктураОтбора = Новый Структура;
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(ДатаПримененияОтбора) Тогда
		СтруктураОтбора.Вставить("ДатаПримененияОтбора", ДатаПримененияОтбора);
	КонецЕсли; 
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("МножественныйВыбор", МножественныйВыбор);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", НЕ МножественныйВыбор);
		
	Если ЗначениеЗаполнено(Организация) Тогда
		СтруктураОтбора.Вставить("Организация", Организация);
	КонецЕсли; 
		
	Если ЗначениеЗаполнено(Подразделение) Тогда
		СтруктураОтбора.Вставить("Подразделение", Подразделение);
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(МОЛ) Тогда
		СтруктураОтбора.Вставить("МОЛ", МОЛ);
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(Склад) Тогда
		СтруктураОтбора.Вставить("Склад", Склад);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Непринятые) Тогда
		СтруктураОтбора.Вставить("Непринятые", Непринятые);
	КонецЕсли; 
	
	Если СтруктураОтбора.Количество() > 0 Тогда
		ПараметрыФормы.Вставить("Отбор", СтруктураОтбора);
	КонецЕсли;
	
	Если МножественныйВыбор И НЕ ПустаяСтрока(АдресСпискаПодобранныхОС) Тогда
		ПараметрыФормы.Вставить("АдресСпискаПодобранныхОС", АдресСпискаПодобранныхОС);
	КонецЕсли; 
	
	ОткрытьФорму("Справочник.ОсновныеСредства.ФормаВыбора", ПараметрыФормы, ВладелецФормыВыбора);	
	
КонецПроцедуры

#Область РаботаСПодбором

Процедура ОткрытьПодбор(ФормаВладелец, ИмяТабличнойЧасти) Экспорт
	
	ПараметрыПодбора = Новый Структура;
	Отказ = Ложь;
	
	ЗаполнитьЗначенияПараметровПодбора(ФормаВладелец, ИмяТабличнойЧасти, ПараметрыПодбора);
	
	Если НЕ Отказ Тогда
		ОписаниеОповещенияПриЗакрытииПодбора = Новый ОписаниеОповещения("ПриЗакрытииПодбора", ЭтотОбъект);
		ОткрытьФорму("Обработка.ПодборОС.Форма.Корзина", 
			ПараметрыПодбора, ФормаВладелец, Истина, , , ОписаниеОповещенияПриЗакрытииПодбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОткрытьПодборКомплектацияОС(ФормаВладелец, ИмяТабличнойЧасти) Экспорт
	
	ПараметрыПодбора = Новый Структура;
	Отказ = Ложь;
	
	ЗаполнитьЗначенияПараметровПодбора(ФормаВладелец, ИмяТабличнойЧасти, ПараметрыПодбора);
	
	Если НЕ Отказ Тогда
		ОписаниеОповещенияПриЗакрытииПодбора = Новый ОписаниеОповещения("ПриЗакрытииПодбора", ЭтотОбъект);
		ОткрытьФорму("Обработка.ПодборОС.Форма.КорзинаКомплектацияОС", 
			ПараметрыПодбора, ФормаВладелец, Истина, , , ОписаниеОповещенияПриЗакрытииПодбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры

// Процедура обработки результатов закрытия подбора
//
Процедура ПриЗакрытииПодбора(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(РезультатЗакрытия) = Тип("Структура") Тогда
		Если НЕ ПустаяСтрока(РезультатЗакрытия.АдресКорзиныВХранилище) Тогда
			Оповестить("ПодборОСПроизведен", РезультатЗакрытия.АдресКорзиныВХранилище, РезультатЗакрытия.УникальныйИдентификаторФормыВладельца);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // ПриЗакрытииПодбора()

// Получение данных из форм-владельцев

Процедура ЗаполнитьЗначенияПараметровПодбора(ФормаВладелец, ИмяТабличнойЧасти, ПараметрыПодбора)
	
	ПараметрыПодбора.Вставить("ДокументСсылка", ФормаВладелец.ЭтотОбъект.Объект.Ссылка);
	ПараметрыПодбора.Вставить("Организация", ФормаВладелец.ЭтотОбъект.Объект.Организация);
	ПараметрыПодбора.Вставить("Дата", ФормаВладелец.ДатаДокумента);
	ПараметрыПодбора.Вставить("УникальныйИдентификаторФормыВладельца", ФормаВладелец.УникальныйИдентификатор);
	
	ЗаполнитьВидОперацииДокумента(ФормаВладелец, ПараметрыПодбора);
	ЗаполнитьПараметрВалютаДокумента(ФормаВладелец, ПараметрыПодбора);
	ЗаполнитьПараметрМестонахождение(ФормаВладелец, ПараметрыПодбора);
	ЗаполнитьДополнительныеПараметры(ФормаВладелец, ПараметрыПодбора);
	
	ЗаполнитьСписокПодобранных(ФормаВладелец, ПараметрыПодбора, ИмяТабличнойЧасти);
	
КонецПроцедуры

Процедура ЗаполнитьВидОперацииДокумента(ФормаВладелец, ПараметрыПодбора)
	Перем ВидОперации;
	
	Если ФормаВладелец.Объект.Свойство("ВидОперации", ВидОперации) Тогда
		
		ПараметрыПодбора.Вставить("ВидОперации", ВидОперации);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьСписокПодобранных(ФормаВладелец, ПараметрыПодбора, ИмяТабличнойЧасти)
	СписокПодобранных = Новый СписокЗначений;
	Для Каждого СтрокаТабличнойЧасти Из ФормаВладелец.Объект[ИмяТабличнойЧасти] Цикл 
		СписокПодобранных.Добавить(СтрокаТабличнойЧасти.ОсновноеСредство);
	КонецЦикла;
	
	ПараметрыПодбора.Вставить("СписокПодобранных", СписокПодобранных);		
КонецПроцедуры

Процедура ЗаполнитьПараметрВалютаДокумента(ФормаВладелец, ПараметрыПодбора)
	
	Если ФормаВладелец.Объект.Свойство("ВалютаДокумента") Тогда
		ПараметрыПодбора.Вставить("ВалютаДокумента", ФормаВладелец.Объект.ВалютаДокумента);
	Иначе
		ПараметрыПодбора.Вставить("ВалютаДокумента", Неопределено);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьПараметрМестонахождение(ФормаВладелец, ПараметрыПодбора)
	Перем Склад;
	Перем Подразделение;
	Перем МОЛ;
	
	Если СтрНайти(ФормаВладелец.ИмяФормы, "ПоступлениеТоваровУслуг") > 0 
		Или СтрНайти(ФормаВладелец.ИмяФормы, "ПринятиеКУчетуОС") > 0
		Или СтрНайти(ФормаВладелец.ИмяФормы, "ВводНачальныхОстатков") > 0
		Или СтрНайти(ФормаВладелец.ИмяФормы, "СчетНаОплатуПокупателю") > 0 Тогда
		
		ФормаВладелец.ЭтотОбъект.Объект.Свойство("Склад", Склад);
		ПараметрыПодбора.Вставить("Склад", Склад);
		
	ИначеЕсли СтрНайти(ФормаВладелец.ИмяФормы, "ИнвентаризацияОС") > 0
		Или СтрНайти(ФормаВладелец.ИмяФормы, "ПеремещениеОС") > 0
		Или СтрНайти(ФормаВладелец.ИмяФормы, "РеализацияТоваровУслуг") > 0
		Или СтрНайти(ФормаВладелец.ИмяФормы, "СписаниеОС") > 0 
		Или СтрНайти(ФормаВладелец.ИмяФормы, "КомплектацияОС") > 0 Тогда 
		
		ФормаВладелец.ЭтотОбъект.Объект.Свойство("Подразделение", Подразделение);
		ПараметрыПодбора.Вставить("Подразделение", Подразделение);
		
		Если НЕ ЗначениеЗаполнено(Подразделение) Тогда 
			ФормаВладелец.ЭтотОбъект.Объект.Свойство("ПодразделениеОтправитель", Подразделение);
			ПараметрыПодбора.Вставить("Подразделение", Подразделение);
		КонецЕсли;	
		
		ФормаВладелец.ЭтотОбъект.Объект.Свойство("МОЛ", МОЛ);
		ПараметрыПодбора.Вставить("МОЛ", МОЛ);
		
		Если НЕ ЗначениеЗаполнено(МОЛ) Тогда 
			ФормаВладелец.ЭтотОбъект.Объект.Свойство("МОЛОтправитель", МОЛ);
			ПараметрыПодбора.Вставить("МОЛ", МОЛ);
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьДополнительныеПараметры(ФормаВладелец, ПараметрыПодбора)
	Перем СчетУчета;
	
	СостоянияОС = Новый СписокЗначений;
	
	Если ФормаВладелец.ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокументаОбщая" 
		Или ФормаВладелец.ИмяФормы = "Документ.АвансовыйОтчет.Форма.ФормаДокумента" Тогда
		
		СостоянияОС.Добавить("БезСостояния");
		
		ПараметрыПодбора.Вставить("ЭтоДокументПоступления", Истина);
		ПараметрыПодбора.Вставить("КонтролироватьМестонахождение", Ложь);
		
	ИначеЕсли ФормаВладелец.ИмяФормы = "Документ.ПринятиеКУчетуОС.Форма.ФормаДокумента" Тогда
		Если ПараметрыПодбора.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПринятияКУчетуОсновныхСредств.ОсновныеСредства") Тогда 
			СостоянияОС.Добавить(ПредопределенноеЗначение("Перечисление.ВидыСостоянийОС.Поступило"));
			ПараметрыПодбора.Вставить("ЭтоДокументПоступления", Ложь);
		Иначе
			СостоянияОС.Добавить("БезСостояния");
			ПараметрыПодбора.Вставить("ЭтоДокументПоступления", Истина);
		КонецЕсли;
		
		ПараметрыПодбора.Вставить("КонтролироватьМестонахождение", Ложь);
		
	ИначеЕсли ФормаВладелец.ИмяФормы = "Документ.СписаниеОС.Форма.ФормаДокумента" Тогда
		Если ФормаВладелец.Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийСписанияОС.ПринятыеКУчетуОС") Тогда
			СостоянияОС.Добавить(ПредопределенноеЗначение("Перечисление.ВидыСостоянийОС.ПринятоКУчету"));		
		ИначеЕсли ФормаВладелец.Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийСписанияОС.НеПринятыеКУчетуОС") Тогда	
			СостоянияОС.Добавить(ПредопределенноеЗначение("Перечисление.ВидыСостоянийОС.Поступило"));		
		КонецЕсли;
		ПараметрыПодбора.Вставить("ЭтоДокументПоступления", Ложь);
		ПараметрыПодбора.Вставить("КонтролироватьМестонахождение", Истина);					
		
	ИначеЕсли ФормаВладелец.ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента"
		Или ФормаВладелец.ИмяФормы = "Документ.ИнвентаризацияОС.Форма.ФормаДокумента" 
		Или ФормаВладелец.ИмяФормы = "Документ.ВыработкаОС.Форма.ФормаДокумента" 
		ИЛИ ФормаВладелец.ИмяФормы = "Документ.СчетНаОплатуПокупателю.Форма.ФормаДокумента" Тогда
		
		СостоянияОС.Добавить(ПредопределенноеЗначение("Перечисление.ВидыСостоянийОС.ПринятоКУчету"));
		СостоянияОС.Добавить(ПредопределенноеЗначение("Перечисление.ВидыСостоянийОС.Поступило"));		
		ПараметрыПодбора.Вставить("ЭтоДокументПоступления", Ложь);
		ПараметрыПодбора.Вставить("КонтролироватьМестонахождение", Ложь);
		
	ИначеЕсли ФормаВладелец.ИмяФормы = "Документ.КомплектацияОС.Форма.ФормаДокумента" Тогда 
		СостоянияОС.Добавить(ПредопределенноеЗначение("Перечисление.ВидыСостоянийОС.Поступило"));
		СостоянияОС.Добавить(ПредопределенноеЗначение("Перечисление.ВидыСостоянийОС.ПринятоКУчету"));
		СостоянияОС.Добавить(ПредопределенноеЗначение("Перечисление.ВидыСостоянийОС.Передано"));
		СостоянияОС.Добавить(ПредопределенноеЗначение("Перечисление.ВидыСостоянийОС.СнятоСУчета"));
		
		ПараметрыПодбора.Вставить("ЭтоДокументПоступления", Ложь);
		ПараметрыПодбора.Вставить("КонтролироватьМестонахождение", Истина);	
		
	Иначе 
		СостоянияОС.Добавить(ПредопределенноеЗначение("Перечисление.ВидыСостоянийОС.Поступило"));
		СостоянияОС.Добавить(ПредопределенноеЗначение("Перечисление.ВидыСостоянийОС.ПринятоКУчету"));
		СостоянияОС.Добавить(ПредопределенноеЗначение("Перечисление.ВидыСостоянийОС.Передано"));
		СостоянияОС.Добавить(ПредопределенноеЗначение("Перечисление.ВидыСостоянийОС.СнятоСУчета"));
		
		ПараметрыПодбора.Вставить("ЭтоДокументПоступления", Ложь);
		ПараметрыПодбора.Вставить("КонтролироватьМестонахождение", Истина);
	КонецЕсли;
	
	ПараметрыПодбора.Вставить("СостоянияОС", СостоянияОС);		
	
КонецПроцедуры

// Конец Получение данных из форм-владельцев

#КонецОбласти

#КонецОбласти
